<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#A-guide-to-databases-and-SQL" data-toc-modified-id="A-guide-to-databases-and-SQL-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>A guide to databases and SQL</a></span><ul class="toc-item"><li><span><a href="#Learning-goals:" data-toc-modified-id="Learning-goals:-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning goals:</a></span></li><li><span><a href="#Goal-1:-Summarize" data-toc-modified-id="Goal-1:-Summarize-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Goal 1: Summarize</a></span><ul class="toc-item"><li><span><a href="#What-is-a-Relational-Database?" data-toc-modified-id="What-is-a-Relational-Database?-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span>What is a Relational Database?</a></span></li><li><span><a href="#POPULAR-RDBMS" data-toc-modified-id="POPULAR-RDBMS-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>POPULAR RDBMS</a></span></li></ul></li><li><span><a href="#Goal-2:-Database-Terminology" data-toc-modified-id="Goal-2:-Database-Terminology-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Goal 2: Database Terminology</a></span><ul class="toc-item"><li><span><a href="#Relational-Database-Schema" data-toc-modified-id="Relational-Database-Schema-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span>Relational Database Schema</a></span></li><li><span><a href="#Table-columns-view" data-toc-modified-id="Table-columns-view-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Table columns view</a></span></li><li><span><a href="#Terminology" data-toc-modified-id="Terminology-1.3.3"><span class="toc-item-num">1.3.3&nbsp;&nbsp;</span>Terminology</a></span></li><li><span><a href="#SQLite" data-toc-modified-id="SQLite-1.3.4"><span class="toc-item-num">1.3.4&nbsp;&nbsp;</span>SQLite</a></span></li></ul></li><li><span><a href="#Goal-3:-Get-going-with-sqlite!" data-toc-modified-id="Goal-3:-Get-going-with-sqlite!-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Goal 3: Get going with sqlite!</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Load-a-DB-object-with-connect-and-cursor" data-toc-modified-id="Load-a-DB-object-with-connect-and-cursor-1.4.0.1"><span class="toc-item-num">1.4.0.1&nbsp;&nbsp;</span>Load a DB object with <code>connect</code> and <code>cursor</code></a></span></li><li><span><a href="#Use-sqlite_master-to-find-all-the-tables-in-the-schema" data-toc-modified-id="Use-sqlite_master-to-find-all-the-tables-in-the-schema-1.4.0.2"><span class="toc-item-num">1.4.0.2&nbsp;&nbsp;</span>Use sqlite_master to find all the tables in the schema</a></span></li><li><span><a href="#Get-information-about-one-table" data-toc-modified-id="Get-information-about-one-table-1.4.0.3"><span class="toc-item-num">1.4.0.3&nbsp;&nbsp;</span>Get information about one table</a></span></li><li><span><a href="#Use-description" data-toc-modified-id="Use-description-1.4.0.4"><span class="toc-item-num">1.4.0.4&nbsp;&nbsp;</span>Use description</a></span></li><li><span><a href="#Making-fetch-happen" data-toc-modified-id="Making-fetch-happen-1.4.0.5"><span class="toc-item-num">1.4.0.5&nbsp;&nbsp;</span>Making fetch happen</a></span></li></ul></li></ul></li><li><span><a href="#Goal-4:-Use-basic-SQL-commands" data-toc-modified-id="Goal-4:-Use-basic-SQL-commands-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>Goal 4: Use basic SQL commands</a></span><ul class="toc-item"><li><span><a href="#Construct-SQL-queries" data-toc-modified-id="Construct-SQL-queries-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>Construct SQL queries</a></span><ul class="toc-item"><li><span><a href="#Options-for-each:" data-toc-modified-id="Options-for-each:-1.5.1.1"><span class="toc-item-num">1.5.1.1&nbsp;&nbsp;</span>Options for each:</a></span></li></ul></li><li><span><a href="#Practice" data-toc-modified-id="Practice-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Practice</a></span></li><li><span><a href="#SQL-Joins" data-toc-modified-id="SQL-Joins-1.5.3"><span class="toc-item-num">1.5.3&nbsp;&nbsp;</span>SQL Joins</a></span></li></ul></li></ul></li></ul></div>

# Objectives

- Use SQL subqueries to nest queries
- Identify common SQL dialects and tools
- Query data from web databases

In [1]:
import pandas as pd
import sqlite3

# SQL Subqueries

Like you might nest one function within another in Python, you can nest queries in SQL. We can use a **subquery** within another query to succinctly implement queries that have multiple query steps.

In [2]:
conn = sqlite3.connect('flights.db')

## Subqueries in `FROM`

You can use a subquery in the `FROM` clause - this is useful, for example, if you want to apply multiple aggregation functions.

Let say we want to get the average of the number of routes departing from all airports. First we'd need to get the total number of routes departing from all airports, then take the average.

In [3]:
pd.read_sql('''
    SELECT 
        source AS depart_airport
        , COUNT() AS number_of_departures
    FROM
        routes
    GROUP BY
        source
''', conn)

     depart_airport  number_of_departures
0               AAE                     9
1               AAL                    20
2               AAN                     2
3               AAQ                     3
4               AAR                     8
...             ...                   ...
3404            ZUH                    60
3405            ZUM                     2
3406            ZVK                     3
3407            ZYI                    15
3408            ZYL                     4

[3409 rows x 2 columns]

We can use this query as a subquery, and take the average of the new `number_of_departures` column.

In [4]:
pd.read_sql('''
    SELECT AVG(number_of_departures)
    FROM 
        (SELECT 
            source AS depart_airport
            , COUNT() AS number_of_departures
        FROM
            routes
        GROUP BY
            source)
''', conn)

   AVG(number_of_departures)
0                  19.848343

## Subqueries in `WHERE`

You can use a subquery in the `WHERE` clause - this is useful, for example, if you want to filter a query based on results from another query.

Let's say that we want to get all of the departures and destinations for flight routes, but I only want them for flights departing from the five countries with the most airports.

To do this, we'd first need to identify the five countries that have the most airports.

In [5]:
pd.read_sql('''
    SELECT 
        country,  
        COUNT() AS number_of_airports_in_country
    FROM
        airports
    GROUP BY
        country
    ORDER BY
        number_of_airports_in_country DESC
    LIMIT 5
''', conn)

         country  number_of_airports_in_country
0  United States                           1697
1         Canada                            435
2        Germany                            321
3      Australia                            263
4         Russia                            249

I could enter these results into a new query of the routes table to get the data I want.

In [6]:
pd.read_sql('''
    SELECT 
        rt.source AS depart_airport, 
        rt.dest AS destination_airport, 
        ap.country AS depart_country
    FROM
        routes AS rt
    LEFT JOIN airports AS ap
        ON rt.source_id = ap.id
    WHERE ap.country IN ("United States", "Canada", "Germany", "Australia", "Russia")
    ORDER BY depart_country
''', conn)

      depart_airport destination_airport depart_country
0                DRW                 SIN      Australia
1                PER                 SIN      Australia
2                MEL                 CTU      Australia
3                SYD                 CKG      Australia
4                ADL                 BNE      Australia
...              ...                 ...            ...
20330            SOW                 FMN  United States
20331            SOW                 PHX  United States
20332            SVC                 PHX  United States
20333            VIS                 LAX  United States
20334            WRL                 CYS  United States

[20335 rows x 3 columns]

This approach works but has a few limitations:

- We have to manually enter the countries to filter them
- The list of countries won't update with our data, so we'd have to monitor and manually change them in the future
- We have to look at two separate queries to understand what our code is supposed to do
- We have to run two separate queries, which might take longer than one combined query

A better solution uses a subquery to get the list of 5 countries and feed it into our WHERE clause.

In [7]:
pd.read_sql('''
    SELECT 
        rt.source AS depart_airport, 
        rt.dest AS destination_airport, 
        ap.country AS depart_country
    FROM
        routes AS rt
    LEFT JOIN airports AS ap
        ON rt.source_id = ap.id
    WHERE ap.country IN 
    -- Subquery to get the 5 countries with the most airports
    
        (SELECT country 
         FROM airports
         GROUP BY country
         ORDER BY COUNT() DESC
         LIMIT 5)
    
    ORDER BY depart_country
''', conn)

      depart_airport destination_airport depart_country
0                DRW                 SIN      Australia
1                PER                 SIN      Australia
2                MEL                 CTU      Australia
3                SYD                 CKG      Australia
4                ADL                 BNE      Australia
...              ...                 ...            ...
20330            SOW                 FMN  United States
20331            SOW                 PHX  United States
20332            SVC                 PHX  United States
20333            VIS                 LAX  United States
20334            WRL                 CYS  United States

[20335 rows x 3 columns]

## Level Up: Common Table Expressions

Common Table Expressions (CTEs) are a more readable way to implement subqueries, using `WITH` and `AS`.

In [8]:
pd.read_sql('''

    WITH top_5_countries AS 
        (SELECT country 
         FROM airports
         GROUP BY country
         ORDER BY COUNT() DESC
         LIMIT 5) 
    
    SELECT 
        rt.source AS depart_airport, 
        rt.dest AS destination_airport, 
        ap.country AS depart_country
    FROM
        routes AS rt
    LEFT JOIN airports AS ap
        ON rt.source_id = ap.id
    WHERE ap.country IN top_5_countries
    
    ORDER BY depart_country
''', conn)

      depart_airport destination_airport depart_country
0                DRW                 SIN      Australia
1                PER                 SIN      Australia
2                MEL                 CTU      Australia
3                SYD                 CKG      Australia
4                ADL                 BNE      Australia
...              ...                 ...            ...
20330            SOW                 FMN  United States
20331            SOW                 PHX  United States
20332            SVC                 PHX  United States
20333            VIS                 LAX  United States
20334            WRL                 CYS  United States

[20335 rows x 3 columns]

# SQL Versions

The is no one version of SQL - there are many versions out there! What you're learning about SQL with SQLite will apply to all of them. Just keep in mind when you apply for jobs that you may see any of these listed in any given job posting, and they are all just different versions of what you know.

## SQL Dialects

As with dialects of spoken languages, SQL dialects have many commonalities but some differences in syntax and functionality.  Here are a few of the major players:

- SQLite (we've already seen this!)
- PostgreSQL (free and open-source!)
- Oracle SQL
- MySQL (half open-souce, half Oracle)
- Microsoft SQL Server
- Transact-SQL (extends MS SQL)

## SQLite Pros & Cons

We use SQLite in this course, but it has some limitations.

### Pros

- Easy to set up
- Easy to share database files
- Uses little memory

### Cons

- Limited functionality for managing users and access permissions
- Not "thread safe": two edits at the same time can mess up your data

## Extra Resources: SQL Versions

[What Is a SQL Dialect, and Which one Should You Learn?](https://learnsql.com/blog/what-sql-dialect-to-learn/)

[SQLite vs MySQL vs PostgreSQL](https://www.digitalocean.com/community/tutorials/sqlite-vs-mysql-vs-postgresql-a-comparison-of-relational-database-management-systems)

[SQL Dialect Reference](https://en.wikibooks.org/wiki/SQL_Dialects_Reference)

# Web Databases: data.world

For the rest of this lesson, we'll be exploring databases in [data.world](https://data.world/), a web database that we can query using SQL in our browser. For reference, you can see the instructions for creating a new project here: [Getting Started Working with Data at data.world](https://help.data.world/hc/en-us/articles/360008853693-Getting-started-guide#working_with_data)

## Step 1: Create a data.world account

You will need to enter and verify your email address.

## Step 2: Create a project using this [Austin AirBnB](https://data.world/jonloyens/inside-airbnb-austin) dataset

Navigate to [this page](https://data.world/jonloyens/inside-airbnb-austin) and use the button at the top right of the page to create a new project using the data.

![](img/data_world_austin_airbnb_new_proj.png)

## Step 3: Create a SQL query

In your project, use the "+ Add" button to add a SQL query.

![](img/data_world_add_sql_query.png)

## Step 4: Run a simple SQL query

Try entering "SELECT * FROM listings" and clicking the "Run Query" button in the top right.

## Step 5: Practice using SQL to explore the data

Below are some exercises to practice your SQL skills and help explore the data. You will need to explore the table schemas to complete these exercises. 

You may find it helpful to click on the corresponding .csv files to inspect the data, or look at the columns in each table in the right sidebar.

### Exercise 1: Create a table showing the number of listings in each neighborhood
<p>
</p>
<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

    SELECT neighbourhood, COUNT(*)
    FROM listings
    GROUP BY neighbourhood
    
</details>

### Exercise 2: Create a table showing the 20 listings with the most reviews
<p>
</p>
<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

    SELECT *
    FROM listings
    ORDER BY number_of_reviews DESC
    LIMIT 20
    
</details>

### Exercise 3: Create a table showing all of the reviews for listings that are "Bed & Breakfast" property types.
<p>
</p>
<details>
    <summary><b><u>Click Here for Answer Code</u></b></summary>

    SELECT *
    FROM reviews
    INNER JOIN listings
        ON listings.id = reviews.listing_id
    WHERE listings.property_type = "Bed & Breakfast"
    
</details>

### Exercise 4: Run your own query using a subquery or CTE.

Note that the syntax and functionality for subqueries and CTEs in data.world are more limited than SQLite, so try creating simple ones.